# Арифметичні операції з змінною x
x = 5
print(x)
x += 1 # Збільшуємо значення x на 1 (x = x + 1), тепер x = 6
print(x)
x -= 1 # Зменшуємо значення x на 1 (x = x - 1), тепер x = 5
print(x)
x *= 1 # Множимо значення x на 1, результат не змінюється (x = 5 * 1)
print(x)
x /= 1 # Ділимо значення x на 1, результат не змінюється (x = 5 / 1)
print(x)
x **= 2 # Підносимо значення x до квадрату (x = 5 ** 2), тепер x = 25
print(x)
x //= 2 # Цілочисельне ділення x на 2 (x = 25 // 2), тепер x = 12
print(x)
x %= 2 # Залишок від ділення x на 2 (x = 12 % 2), тепер x = 0
print(x)

# Логічні оператори
print(True and True)  # Істинно, оскільки обидва значення True
print(False and True)  # Хибно, оскільки перше значення False
print(False and False)  # Хибно, оскільки обидва значення False

print(True or True)  # Істинно, оскільки обидва значення True
print(False or True)  # Істинно, оскільки друге значення True
print(False or False)  # Хибно, оскільки обидва значення False

print(not True)  # Логічне заперечення, результат False
print(not False)  # Логічне заперечення, результат True

# Перевірка складної умови за допомогою логічних операторів
print(5 > 4 and 3 > 2)  # Істинно, оскільки обидва порівняння є істинними
print(5 > 4 and 3 < 2)  # Хибно, оскільки друге порівняння є хибним

print(5 > 4 or 3 < 2)  # Істинно, оскільки перше порівняння є істинним
print(5 < 4 or 3 < 2)  # Хибно, оскільки обидва порівняння є хибними

# Приклад з комбінованими умовами
# Логіка за допомогою "not", "and" та "or"
print(not(("HELLO".isupper() and "1234".isdigit()) and ("hello".islower() and "123".isalpha())))
# Тут спочатку перевіряється, чи всі умови виконуються: чи "HELLO" в верхньому регістрі і чи є "1234" цифрами, а також чи "hello" в нижньому регістрі і чи "123" складається лише з літер.
# Після цього результат інвертується за допомогою "not"
